# Springboard Data Science Career Track Unit 4 Challenge - Tier 3 Complete

## Objectives
Hey! Great job getting through those challenging DataCamp courses. You're learning a lot in a short span of time. 

In this notebook, you're going to apply the skills you've been learning, bridging the gap between the controlled environment of DataCamp and the *slightly* messier work that data scientists do with actual datasets!

Here’s the mystery we’re going to solve: ***which boroughs of London have seen the greatest increase in housing prices, on average, over the last two decades?***


A borough is just a fancy word for district. You may be familiar with the five boroughs of New York… well, there are 32 boroughs within Greater London [(here's some info for the curious)](https://en.wikipedia.org/wiki/London_boroughs). Some of them are more desirable areas to live in, and the data will reflect that with a greater rise in housing prices.

***This is the Tier 3 notebook, which means it's not filled in at all: we'll just give you the skeleton of a project, the brief and the data. It's up to you to play around with it and see what you can find out! Good luck! If you struggle, feel free to look at easier tiers for help; but try to dip in and out of them, as the more independent work you do, the better it is for your learning!***

This challenge will make use of only what you learned in the following DataCamp courses: 
- Prework courses (Introduction to Python for Data Science, Intermediate Python for Data Science)
- Data Types for Data Science
- Python Data Science Toolbox (Part One) 
- pandas Foundations
- Manipulating DataFrames with pandas
- Merging DataFrames with pandas

Of the tools, techniques and concepts in the above DataCamp courses, this challenge should require the application of the following: 
- **pandas**
    - **data ingestion and inspection** (pandas Foundations, Module One) 
    - **exploratory data analysis** (pandas Foundations, Module Two)
    - **tidying and cleaning** (Manipulating DataFrames with pandas, Module Three) 
    - **transforming DataFrames** (Manipulating DataFrames with pandas, Module One)
    - **subsetting DataFrames with lists** (Manipulating DataFrames with pandas, Module One) 
    - **filtering DataFrames** (Manipulating DataFrames with pandas, Module One) 
    - **grouping data** (Manipulating DataFrames with pandas, Module Four) 
    - **melting data** (Manipulating DataFrames with pandas, Module Three) 
    - **advanced indexing** (Manipulating DataFrames with pandas, Module Four) 
- **matplotlib** (Intermediate Python for Data Science, Module One)
- **fundamental data types** (Data Types for Data Science, Module One) 
- **dictionaries** (Intermediate Python for Data Science, Module Two)
- **handling dates and times** (Data Types for Data Science, Module Four)
- **function definition** (Python Data Science Toolbox - Part One, Module One)
- **default arguments, variable length, and scope** (Python Data Science Toolbox - Part One, Module Two) 
- **lambda functions and error handling** (Python Data Science Toolbox - Part One, Module Four)

## The Data Science Pipeline

This is Tier Three, so we'll get you started. But after that, it's all in your hands! When you feel done with your investigations, look back over what you've accomplished, and prepare a quick presentation of your findings for the next mentor meeting. 

Data Science is magical. In this case study, you'll get to apply some complex machine learning algorithms. But as  [David Spiegelhalter](https://www.youtube.com/watch?v=oUs1uvsz0Ok) reminds us, there is no substitute for simply **taking a really, really good look at the data.** Sometimes, this is all we need to answer our question.

Data Science projects generally adhere to the four stages of Data Science Pipeline:
1. Sourcing and loading 
2. Cleaning, transforming, and visualizing 
3. Modeling 
4. Evaluating and concluding

### 1. Sourcing and Loading 

Any Data Science project kicks off by importing  ***pandas***. The documentation of this wonderful library can be found [here](https://pandas.pydata.org/). As you've seen, pandas is conveniently connected to the [Numpy](http://www.numpy.org/) and [Matplotlib](https://matplotlib.org/) libraries. 

***Hint:*** This part of the data science pipeline will test those skills you acquired in the pandas Foundations course, Module One.

#### 1.1. Importing Libraries

In [1]:
# Let's import the pandas, numpy libraries as pd, and np respectively. 
import pandas as pd
import numpy as np

# Load the pyplot collection of functions from matplotlib, as plt 
import matplotlib.pyplot as plt

#### 1.2.  Loading the data
Your data comes from the [London Datastore](https://data.london.gov.uk/): a free, open-source data-sharing portal for London-oriented datasets.

In [2]:
# First, make a variable called url_LondonHousePrices, and assign it the following link, enclosed in quotation-marks as a string:
# https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls

#_ _ _ = "https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls"
properties = pd.read_csv('../data/UK_House_price_index.csv')

# The dataset we're interested in contains the Average prices of the houses, and is actually on a particular sheet of the Excel file. 
# As a result, we need to specify the sheet name in the read_excel() method.
# Put this data into a variable called properties.  
#properties = pd._ _ _(url_LondonHousePrices, sheet_name='Average price', index_col= None)

### 2. Cleaning, transforming, and visualizing
This second stage is arguably the most important part of any Data Science project. The first thing to do is take a proper look at the data. Cleaning forms the majority of this stage, and can be done both before or after Transformation.

The end goal of data cleaning is to have tidy data. When data is tidy: 

1. Each variable has a column.
2. Each observation forms a row.

Keep the end goal in mind as you move through this process, every step will take you closer. 



***Hint:*** This part of the data science pipeline should test those skills you acquired in: 
- Intermediate Python for data science, all modules.
- pandas Foundations, all modules. 
- Manipulating DataFrames with pandas, all modules.
- Data Types for Data Science, Module Four.
- Python Data Science Toolbox - Part One, all modules

**2.1. Exploring your data** 

Think about your pandas functions for checking out a dataframe.

In [3]:
# First off, let's use .shape feature of pandas DataFrames to look at the number of rows and columns. 
properties.shape

(344, 49)

In [4]:
# Using the .head() method, let's check out the state of our dataset.  
properties.head()

,Unnamed: 0,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,Ealing,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
0,NaN,E09000001,E09000002,E09000003,E09000004,E09000005,E09000006,E09000007,E09000008,E09000009,...,E12000002,E12000003,E12000004,E12000005,E12000006,E12000007,E12000008,E12000009,NaN,E92000001
1,Jan-95,11.7,22.9,20.2,24.8,16.9,21.9,15.7,23.9,19.4,...,32.3,32.9,29.6,30.6,24.8,18.5,24.2,25.7,NaN,26.2
2,Feb-95,10.5,23.2,20.2,24.8,17.0,21.9,15.5,23.9,19.6,...,32.3,32.7,30.0,31.1,24.8,18.1,24.1,25.5,NaN,26.2
3,Mar-95,10.1,23.3,20.0,24.6,17.0,21.8,15.6,23.8,19.7,...,32.7,33.2,29.5,31.2,24.6,18.3,24.2,25.2,NaN,26.2
4,Apr-95,9.8,24.1,19.7,24.6,17.3,21.8,15.6,23.8,19.9,...,32.5,33.5,30.0,31.2,24.8,18.5,24.4,25.7,NaN,26.4

**2.2. Cleaning the data**

You might find you need to transpose your dataframe, check out what its row indexes are, and reset the index. You  also might find you need to assign the values of the first row to your column headings  . (Hint: recall the .columns feature of DataFrames, as well as the iloc[] method).

Don't be afraid to use StackOverflow for help  with this.

In [5]:
# Do this here
properties_T = properties.T

In [6]:
# Let's check the head of our new Transposed DataFrame. 
properties_T.head()

,0,1,2,3,4,5,6,7,8,9,...,334,335,336,337,338,339,340,341,342,343
Unnamed: 0,NaN,Jan-95,Feb-95,Mar-95,Apr-95,May-95,Jun-95,Jul-95,Aug-95,Sep-95,...,Oct-22,Nov-22,Dec-22,Jan-23,Feb-23,Mar-23,Apr-23,May-23,Jun-23,NaN
City of London,E09000001,11.7,10.5,10.1,9.8,10.8,12.1,14.1,14.3,13.3,...,116.3,121.5,121.7,124.5,109.7,116.2,115.9,124.8,127.8,NaN
Barking & Dagenham,E09000002,22.9,23.2,23.3,24.1,24.1,24.4,23.7,23.7,23.4,...,159.1,160.8,161.8,160.0,156.5,156.2,159.4,160.8,157.7,NaN
Barnet,E09000003,20.2,20.2,20.0,19.7,19.6,19.5,19.8,20.0,20.2,...,129.9,128.5,128.7,129.5,130.3,128.7,127.1,124.7,124.5,NaN
Bexley,E09000004,24.8,24.8,24.6,24.6,24.4,24.5,24.3,24.6,24.6,...,156.9,156.4,156.1,153.2,153.1,152.8,153.7,152.2,151.3,NaN

In [7]:
# To confirm what our row indices are, let's call the .index variable on our properties_T DataFrame. 
properties_T.index

Index(['Unnamed: 0', 'City of London', 'Barking & Dagenham', 'Barnet',
       'Bexley', 'Brent', 'Bromley', 'Camden', 'Croydon', 'Ealing', 'Enfield',
       'Greenwich', 'Hackney', 'Hammersmith & Fulham', 'Haringey', 'Harrow',
       'Havering', 'Hillingdon', 'Hounslow', 'Islington',
       'Kensington & Chelsea', 'Kingston upon Thames', 'Lambeth', 'Lewisham',
       'Merton', 'Newham', 'Redbridge', 'Richmond upon Thames', 'Southwark',
       'Sutton', 'Tower Hamlets', 'Waltham Forest', 'Wandsworth',
       'Westminster', 'Unnamed: 34', 'Inner London', 'Outer London',
       'Unnamed: 37', 'NORTH EAST', 'NORTH WEST', 'YORKS & THE HUMBER',
       'EAST MIDLANDS', 'WEST MIDLANDS', 'EAST OF ENGLAND', 'LONDON',
       'SOUTH EAST', 'SOUTH WEST', 'Unnamed: 47', 'England'],
      dtype='object')

In [8]:
# Our suspicion was correct. 
# Call the .reset_index() method on properties_T to reset the indices, and the reassign the result to properties_T: 
properties_T = properties_T.reset_index()

In [9]:
# Now let's check out our DataFrames indices: 
properties_T.index

RangeIndex(start=0, stop=49, step=1)

In [10]:
# Call the head() function again to check out the new row indices: 
properties_T.head()

,index,0,1,2,3,4,5,6,7,8,...,334,335,336,337,338,339,340,341,342,343
0,Unnamed: 0,NaN,Jan-95,Feb-95,Mar-95,Apr-95,May-95,Jun-95,Jul-95,Aug-95,...,Oct-22,Nov-22,Dec-22,Jan-23,Feb-23,Mar-23,Apr-23,May-23,Jun-23,NaN
1,City of London,E09000001,11.7,10.5,10.1,9.8,10.8,12.1,14.1,14.3,...,116.3,121.5,121.7,124.5,109.7,116.2,115.9,124.8,127.8,NaN
2,Barking & Dagenham,E09000002,22.9,23.2,23.3,24.1,24.1,24.4,23.7,23.7,...,159.1,160.8,161.8,160.0,156.5,156.2,159.4,160.8,157.7,NaN
3,Barnet,E09000003,20.2,20.2,20.0,19.7,19.6,19.5,19.8,20.0,...,129.9,128.5,128.7,129.5,130.3,128.7,127.1,124.7,124.5,NaN
4,Bexley,E09000004,24.8,24.8,24.6,24.6,24.4,24.5,24.3,24.6,...,156.9,156.4,156.1,153.2,153.1,152.8,153.7,152.2,151.3,NaN

In [11]:
# To confirm that our DataFrame's columns are mainly just integers, call the .columns feature on our DataFrame:
properties_T.columns

Index(['index',       0,       1,       2,       3,       4,       5,       6,
             7,       8,
       ...
           334,     335,     336,     337,     338,     339,     340,     341,
           342,     343],
      dtype='object', length=345)

In [12]:
# Call the iloc[] method with double square brackets on the properties_T DataFrame, to see the row at index 0. 
properties_T.iloc[[0]]

,index,0,1,2,3,4,5,6,7,8,...,334,335,336,337,338,339,340,341,342,343
0,Unnamed: 0,NaN,Jan-95,Feb-95,Mar-95,Apr-95,May-95,Jun-95,Jul-95,Aug-95,...,Oct-22,Nov-22,Dec-22,Jan-23,Feb-23,Mar-23,Apr-23,May-23,Jun-23,NaN

In [13]:
# Try this now. 
properties_T.columns = properties_T.iloc[0]

In [14]:
# Check out our DataFrame again: 
properties_T.head()

,Unnamed: 0,NaN,Jan-95,Feb-95,Mar-95,Apr-95,May-95,Jun-95,Jul-95,Aug-95,...,Oct-22,Nov-22,Dec-22,Jan-23,Feb-23,Mar-23,Apr-23,May-23,Jun-23,NaN
0,Unnamed: 0,NaN,Jan-95,Feb-95,Mar-95,Apr-95,May-95,Jun-95,Jul-95,Aug-95,...,Oct-22,Nov-22,Dec-22,Jan-23,Feb-23,Mar-23,Apr-23,May-23,Jun-23,NaN
1,City of London,E09000001,11.7,10.5,10.1,9.8,10.8,12.1,14.1,14.3,...,116.3,121.5,121.7,124.5,109.7,116.2,115.9,124.8,127.8,NaN
2,Barking & Dagenham,E09000002,22.9,23.2,23.3,24.1,24.1,24.4,23.7,23.7,...,159.1,160.8,161.8,160.0,156.5,156.2,159.4,160.8,157.7,NaN
3,Barnet,E09000003,20.2,20.2,20.0,19.7,19.6,19.5,19.8,20.0,...,129.9,128.5,128.7,129.5,130.3,128.7,127.1,124.7,124.5,NaN
4,Bexley,E09000004,24.8,24.8,24.6,24.6,24.4,24.5,24.3,24.6,...,156.9,156.4,156.1,153.2,153.1,152.8,153.7,152.2,151.3,NaN

In [15]:
# Have a go at this now. 
properties_T = properties_T.drop(0)

In [16]:
# Now check out our DataFrame again to see how it looks. 
properties_T.head()

,Unnamed: 0,NaN,Jan-95,Feb-95,Mar-95,Apr-95,May-95,Jun-95,Jul-95,Aug-95,...,Oct-22,Nov-22,Dec-22,Jan-23,Feb-23,Mar-23,Apr-23,May-23,Jun-23,NaN
1,City of London,E09000001,11.7,10.5,10.1,9.8,10.8,12.1,14.1,14.3,...,116.3,121.5,121.7,124.5,109.7,116.2,115.9,124.8,127.8,NaN
2,Barking & Dagenham,E09000002,22.9,23.2,23.3,24.1,24.1,24.4,23.7,23.7,...,159.1,160.8,161.8,160.0,156.5,156.2,159.4,160.8,157.7,NaN
3,Barnet,E09000003,20.2,20.2,20.0,19.7,19.6,19.5,19.8,20.0,...,129.9,128.5,128.7,129.5,130.3,128.7,127.1,124.7,124.5,NaN
4,Bexley,E09000004,24.8,24.8,24.6,24.6,24.4,24.5,24.3,24.6,...,156.9,156.4,156.1,153.2,153.1,152.8,153.7,152.2,151.3,NaN
5,Brent,E09000005,16.9,17.0,17.0,17.3,17.4,17.6,17.5,17.4,...,134.7,133.4,130.8,130.0,126.6,125.1,125.9,125.7,128.0,NaN

**2.3. Cleaning the data (part 2)**

You might we have to **rename** a couple columns. How do you do this? The clue's pretty bold...

In [17]:
# Try this here. 
properties_T = properties_T.rename(columns = {'Unnamed: 0':'London_Borough', pd.NaT:'ID'})

In [18]:
# Let's check out the DataFrame again to admire our good work. 
properties_T.head()

,London_Borough,NaN,Jan-95,Feb-95,Mar-95,Apr-95,May-95,Jun-95,Jul-95,Aug-95,...,Oct-22,Nov-22,Dec-22,Jan-23,Feb-23,Mar-23,Apr-23,May-23,Jun-23,NaN
1,City of London,E09000001,11.7,10.5,10.1,9.8,10.8,12.1,14.1,14.3,...,116.3,121.5,121.7,124.5,109.7,116.2,115.9,124.8,127.8,NaN
2,Barking & Dagenham,E09000002,22.9,23.2,23.3,24.1,24.1,24.4,23.7,23.7,...,159.1,160.8,161.8,160.0,156.5,156.2,159.4,160.8,157.7,NaN
3,Barnet,E09000003,20.2,20.2,20.0,19.7,19.6,19.5,19.8,20.0,...,129.9,128.5,128.7,129.5,130.3,128.7,127.1,124.7,124.5,NaN
4,Bexley,E09000004,24.8,24.8,24.6,24.6,24.4,24.5,24.3,24.6,...,156.9,156.4,156.1,153.2,153.1,152.8,153.7,152.2,151.3,NaN
5,Brent,E09000005,16.9,17.0,17.0,17.3,17.4,17.6,17.5,17.4,...,134.7,133.4,130.8,130.0,126.6,125.1,125.9,125.7,128.0,NaN

In [19]:
# Try this here. 
properties_T.columns

Index(['London_Borough',              nan,         'Jan-95',         'Feb-95',
               'Mar-95',         'Apr-95',         'May-95',         'Jun-95',
               'Jul-95',         'Aug-95',
       ...
               'Oct-22',         'Nov-22',         'Dec-22',         'Jan-23',
               'Feb-23',         'Mar-23',         'Apr-23',         'May-23',
               'Jun-23',              nan],
      dtype='object', name=0, length=345)

**2.4.Transforming the data**

Remember what Wes McKinney said about tidy data? 

You might need to **melt** your DataFrame here.

In [20]:
# Try this here: 
clean_properties = pd.melt(properties_T, id_vars= ['London_Borough', 'ID'])

KeyError: "The following 'id_vars' are not present in the DataFrame: ['ID']"

In [21]:
clean_properties.head()

NameError: name 'clean_properties' is not defined

In [22]:
# Re-name the column names
clean_properties = clean_properties.rename(columns = {0: 'Month', 'value': 'Average_price'})

In [23]:
# Check out the DataFrame: 
clean_properties.head()

In [24]:
# Let's use the .dtypes attribute to check the data types of our clean_properties DataFrame:
clean_properties.dtypes

Remember to make sure your column data types are all correct. Average prices, for example, should be floating point numbers...

In [25]:
# Try this here
clean_properties['Average_price'] = pd.to_numeric(clean_properties['Average_price'])

In [26]:
# Check out the new data types:
clean_properties.dtypes

In [27]:
# To see if there are any missing values, we should call the count() method on our DataFrame:
clean_properties.count()

**2.5. Cleaning the data (part 3)**

Do we have an equal number of observations in the ID, Average Price, Month, and London Borough columns? Remember that there are only 32 London Boroughs. How many entries do you have in that column? 

Check out the contents of the London Borough column, and if you find null values, get rid of them however you see fit.

In [28]:
# Do this here. 
clean_properties['London_Borough'].unique()

In [29]:
# Subset clean_properties on the condition: df['London_Borough'] == 'Unnamed: 34' to see what information these rows contain. 
clean_properties[clean_properties['London_Borough'] == 'Unnamed: 34'].head()

In [30]:
# Let's do the same for 'Unnamed: 37':
clean_properties[clean_properties['London_Borough'] == 'Unnamed: 37'].head()

In [31]:
# Let's look at how many rows have NAs as their value for ID. 
# To this end, subset clean_properties on the condition: clean_properties['ID'].isna().
# Notice that this line doesn't actually reassign a new value to clean_properties. 
clean_properties[clean_properties['ID'].isna()]

In [32]:
# Try your hand at method (1) here: 
NaNFreeDF1 = clean_properties[clean_properties['Average_price'].notna()]
NaNFreeDF1.head(48)

In [33]:
# If we do a count on our new DataFrame, we'll see how many rows we have that have complete information: 
NaNFreeDF1.count()

In [34]:
# filtering the data with NaN values
NaNFreeDF2 = clean_properties.dropna()
NaNFreeDF2.head(48)

In [ ]:
# Let's do a count on this DataFrame object: 
NaNFreeDF2.count()

In [ ]:
NaNFreeDF2['London_Borough'].unique()

In [ ]:
# Using the .shape attribute, compare the dimenions of clean_properties, NaNFreeDF1, and NaNFreeDF2: 
print(clean_properties.shape)
print(NaNFreeDF1.shape)
print(NaNFreeDF2.shape)

In [ ]:
# A list of non-boroughs. 
nonBoroughs = ['Inner London', 'Outer London', 
               'NORTH EAST', 'NORTH WEST', 'YORKS & THE HUMBER', 
               'EAST MIDLANDS', 'WEST MIDLANDS',
              'EAST OF ENGLAND', 'LONDON', 'SOUTH EAST', 
              'SOUTH WEST', 'England']

In [ ]:
# Do this here. 
NaNFreeDF2[NaNFreeDF2.London_Borough.isin(nonBoroughs)]

In [ ]:
NaNFreeDF2[~NaNFreeDF2.London_Borough.isin(nonBoroughs)]

In [ ]:
NaNFreeDF2 = NaNFreeDF2[~NaNFreeDF2.London_Borough.isin(nonBoroughs)]

In [ ]:
NaNFreeDF2.head()

In [ ]:
# Do that here. 
df = NaNFreeDF2

In [ ]:
df.head()

In [ ]:
df.dtypes

**2.6. Visualizing the data**

To visualize the data, why not subset on a particular London Borough? Maybe do a line plot of Month against Average Price?

In [ ]:
# First of all, make a variable called camden_prices, and assign it the result of filtering df on the following condition:
# df['London_Borough'] == 'Camden'
camden_prices = df[df['London_Borough'] == 'Camden']

# Make a variable called ax. Assign it the result of calling the plot() method, and plugging in the following values as parameters:
# kind ='line', x = 'Month', y='Average_price'
ax = camden_prices.plot(kind ='line', x = 'Month', y='Average_price')

# Finally, call the set_ylabel() method on ax, and set that label to the string: 'Price'. 
ax.set_ylabel('Price')

To limit the number of data points you have, you might want to extract the year from every month value your *Month* column. 

To this end, you *could* apply a ***lambda function***. Your logic could work as follows:
1. look through the `Month` column
2. extract the year from each individual value in that column 
3. store that corresponding year as separate column. 

Whether you go ahead with this is up to you. Just so long as you answer our initial brief: which boroughs of London have seen the greatest house price increase, on average, over the past two decades?

In [ ]:
# Try this yourself. 
df['Year'] = df['Month'].apply(lambda t: t.year)
df.tail()

In [ ]:
# Using the function 'groupby' will help you to calculate the mean for each year and for each Borough. 
## As you can see, the variables Borough and Year are now indices
dfg = df.groupby(by=['London_Borough', 'Year']).mean()
dfg.sample(10)

In [ ]:
# Let's reset the index for our new DataFrame dfg, and call the head() method on it. 
dfg = dfg.reset_index()
dfg.head()

**3. Modeling**

Consider creating a function that will calculate a ratio of house prices, comparing the price of a house in 2018 to the price in 1998.

Consider calling this function create_price_ratio.

You'd want this function to:
1. Take a filter of dfg, specifically where this filter constrains the London_Borough, as an argument. For example, one admissible argument should be: dfg[dfg['London_Borough']=='Camden'].
2. Get the Average Price for that Borough, for the years 1998 and 2018.
4. Calculate the ratio of the Average Price for 1998 divided by the Average Price for 2018.
5. Return that ratio.

Once you've written this function, you ultimately want to use it to iterate through all the unique London_Boroughs and work out the ratio capturing the difference of house prices between 1998 and 2018.

Bear in mind: you don't have to write a function like this if you don't want to. If you can solve the brief otherwise, then great! 

***Hint***: This section should test the skills you acquired in:
- Python Data Science Toolbox - Part One, all modules

In [ ]:
# Here's where you should write your function:
def create_price_ratio(d):
    y1998 = float(d['Average_price'][d['Year']==1998])
    y2018 = float(d['Average_price'][d['Year']==2018])
    ratio = [y2018/y1998]
    return ratio

In [ ]:
#  Test out the function by calling it with the following argument:
# dfg[dfg['London_Borough']=='Barking & Dagenham']
create_price_ratio(dfg[dfg['London_Borough']=='Barking & Dagenham'])

In [ ]:
# We want to do this for all of the London Boroughs. 
# First, let's make an empty dictionary, called final, where we'll store our ratios for each unique London_Borough.
final = {}

In [ ]:
# Now let's declare a for loop that will iterate through each of the unique elements of the 'London_Borough' column of our DataFrame dfg.
# Call the iterator variable 'b'. 
for b in dfg['London_Borough'].unique():
    # Let's make our parameter to our create_price_ratio function: i.e., we subset dfg on 'London_Borough' == b. 
    borough = dfg[dfg['London_Borough'] == b]
    # Make a new entry in the final dictionary whose value's the result of calling create_price_ratio with the argument: borough
    final[b] = create_price_ratio(borough)
# We use the function and incorporate that into a new key of the dictionary 
print(final)

In [ ]:
# Make a variable called df_ratios, and assign it the result of calling the DataFrame method on the dictionary final. 
df_ratios = pd.DataFrame(final)

In [ ]:
# Call the head() method on this variable to check it out. 
df_ratios.head()

In [ ]:
# All we need to do now is transpose it, and reset the index! 
df_ratios_T = df_ratios.T
df_ratios = df_ratios_T.reset_index()
df_ratios.head()

In [ ]:
# Let's just rename the 'index' column as 'London_Borough', and the '0' column to '2018'.
df_ratios.rename(columns={'index':'Borough', 0:'2018'}, inplace=True)
df_ratios.head()

In [ ]:
# Let's sort in descending order and select the top 15 boroughs. 
# Make a variable called top15, and assign it the result of calling sort_values() on df_ratios. 
top15 = df_ratios.sort_values(by='2018',ascending=False).head(15)
print(top15)

In [ ]:
#Let's plot the boroughs that have seen the greatest changes in price
ax = top15[['Borough','2018']].plot(kind='bar')
ax.set_xticklabels(top15.Borough)

### 4. Conclusion
What can you conclude? Type out your conclusion below. 

Look back at your notebook. Think about how you might summarize what you have done, and prepare a quick presentation on it to your mentor at your next meeting. 

We hope you enjoyed this practical project. It should have consolidated your data hygiene and pandas skills by looking at a real-world problem involving just the kind of dataset you might encounter as a budding data scientist. Congratulations, and looking forward to seeing you at the next step in the course!

At first there is a question. Which boroughs of London have seen the greatest increase in housing prices, on average, over the last two decades? A borough is just a fancy word for district.

Answer is below:

Borough      2018/1998(Ratio)

1.Hackney  6.198286

2.Waltham Forest  5.834756

3.Southwark  5.516485

4.Lewisham  5.449221

5.Westminster  5.353565

6.Newham  5.305390

7.Haringey  5.134625

8.Kensington & Chelsea  5.082465

9.Lambeth  4.957751

10.Camden  4.935353

11.Barking & Dagenham  4.896619

12.Brent  4.894554

13.Islington  4.844048

14.Greenwich  4.763036

15.Wandsworth  4.757709